schmidtmt/openmotorbridge/firmware/main_controller/sdkconfig.defaults
# ESP32-S3 System & Clock Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DATA_CACHE_32KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# FreeRTOS & Dual-Core Config
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_NUMBER_OF_CORES=2
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# PSRAM Support (8 MB Octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Bluetooth NimBLE Stack
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y

# LittleFS / FATFS Support
CONFIG_FATFS_SECTOR_512=y
CONFIG_FATFS_LFN_HEAP=y